Data Preprocessing
---

- clean the data (remove invalid values) ex: $45,000

- remove unwanted columns

- handle the null values
    
    - drop rows or columns
    
    - use fillna method

- use str methods for clear data

- you can separate the data types

    - numeric data types
    
    - category data types (LabelEncoder and OneHotEncoder)

In [3]:
import numpy as np
import pandas as pd

Read the file
---

In [5]:
df = pd.read_csv(r'/Users/pranay/Downloads/emp data.csv')

In [7]:
df.head()

   employee_id first_name last_name department  salary   hire_date
0            1      Aarav    Sharma         HR   55000  2026-06-04
1            2     Vihaan     Patel         IT   72000  2026-06-04
2            3      Anaya     Gupta        NaN   48000  2026-06-04
3            4     Aditya     Mehta    Finance  -45000  2026-06-04
4            5       Isha     Verma         HR   52000  2026-06-04

In [9]:
df

    employee_id first_name last_name department  salary   hire_date
0             1      Aarav    Sharma         HR   55000  2026-06-04
1             2     Vihaan     Patel         IT   72000  2026-06-04
2             3      Anaya     Gupta        NaN   48000  2026-06-04
3             4     Aditya     Mehta    Finance  -45000  2026-06-04
4             5       Isha     Verma         HR   52000  2026-06-04
..          ...        ...       ...        ...     ...         ...
95           96      Reema    Saluja        NaN   55000  2026-06-04
96           97   Shailesh      Modi         IT   77000  2026-06-04
97           98     Tarini    Bhalla         HR   61000  2026-06-04
98           99       Amol      Kore  Marketing   67500  2026-06-04
99          100       Noor    Ansari    Finance   88000  2026-06-04

[100 rows x 6 columns]

In [11]:
pd.set_option('display.max_rows',None)

In [13]:
pd.set_option('display.max_columns',None)

In [17]:
df.tail()

    employee_id first_name last_name department  salary   hire_date
95           96      Reema    Saluja        NaN   55000  2026-06-04
96           97   Shailesh      Modi         IT   77000  2026-06-04
97           98     Tarini    Bhalla         HR   61000  2026-06-04
98           99       Amol      Kore  Marketing   67500  2026-06-04
99          100       Noor    Ansari    Finance   88000  2026-06-04

Employee data
---------------

- Unwanted Columns -> emp _id, emp_f_name, emp_l_name

check the duplicates of data
---

In [21]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
51    False
52    False
53    False
54    False
55    False
56    False
57    False
58    False
59    False
60    False
61    False
62    False
63    False
64    False
65    False
66    False
67    False
68    False
69    False
70    False
71    False
72    False
73    False
74    False
75    False
76    False
77    False
78    False
79    False
80    False
81    False
82    False
83    False
84    False
85    False
86    False
87    False
88    False
89    False
90    False
91    False
92    False
93    False
94    False
95    False
96    False
97    False
98    False
99    False
dtype: bool

In [23]:
df.duplicated().sum()

0

to handle the duplicates
----

- if there are any duplicates records present then we can use below code to remove it

- df.drop_duplicates(inplace=True)

drop unwanted columns
---

In [29]:
df.columns

Index(['employee_id', 'first_name', 'last_name', 'department', 'salary',
       'hire_date'],
      dtype='object')

In [31]:
df.drop(labels=['employee_id','first_name','last_name'],axis=1,inplace=True)

In [33]:
df

   department  salary   hire_date
0          HR   55000  2026-06-04
1          IT   72000  2026-06-04
2         NaN   48000  2026-06-04
3     Finance  -45000  2026-06-04
4          HR   52000  2026-06-04
5          IT   68000  2026-06-04
6         NaN   60000  2026-06-04
7   Marketing  -30000  2026-06-04
8     Finance   75000  2026-06-04
9          IT   80000  2026-06-04
10         HR   51000  2026-06-04
11        NaN   47000  2026-06-04
12  Marketing   62000  2026-06-04
13    Finance  -52000  2026-06-04
14         IT   71000  2026-06-04
15        NaN   58000  2026-06-04
16         HR   54000  2026-06-04
17         IT   69000  2026-06-04
18  Marketing  -41000  2026-06-04
19    Finance   77000  2026-06-04
20         HR   53000  2026-06-04
21        NaN   49000  2026-06-04
22         IT   72000  2026-06-04
23  Marketing   61000  2026-06-04
24    Finance  -36000  2026-06-04
25         IT   83000  2026-06-04
26        NaN   56000  2026-06-04
27         HR   59000  2026-06-04
28  Marketing   64000  2026-06-04
29    Finance   76000  2026-06-04
30        NaN   52000  2026-06-04
31         IT  -70000  2026-06-04
32         HR   55000  2026-06-04
33  Marketing   63000  2026-06-04
34    Finance   79000  2026-06-04
35        NaN   58000  2026-06-04
36         IT   74000  2026-06-04
37         HR   56000  2026-06-04
38  Marketing  -48000  2026-06-04
39    Finance   81000  2026-06-04
40        NaN   50000  2026-06-04
41         HR   54500  2026-06-04
42         IT   70500  2026-06-04
43  Marketing   61500  2026-06-04
44    Finance  -39000  2026-06-04
45        NaN   57500  2026-06-04
46         IT   76000  2026-06-04
47         HR   53500  2026-06-04
48  Marketing   65000  2026-06-04
49    Finance   82000  2026-06-04
50        NaN   60000  2026-06-04
51         HR   56500  2026-06-04
52         IT   73000  2026-06-04
53  Marketing  -44000  2026-06-04
54    Finance   78500  2026-06-04
55        NaN   51000  2026-06-04
56         IT   74500  2026-06-04
57         HR   55500  2026-06-04
58  Marketing   67000  2026-06-04
59    Finance   83000  2026-06-04
60        NaN   49500  2026-06-04
61         HR  -52000  2026-06-04
62         IT   71500  2026-06-04
63  Marketing   62500  2026-06-04
64    Finance   79000  2026-06-04
65        NaN   54000  2026-06-04
66         IT   75500  2026-06-04
67         HR   56000  2026-06-04
68  Marketing  -46000  2026-06-04
69    Finance   84000  2026-06-04
70        NaN   50500  2026-06-04
71         HR   57000  2026-06-04
72         IT   72500  2026-06-04
73  Marketing   63500  2026-06-04
74    Finance   80000  2026-06-04
75        NaN   55500  2026-06-04
76         IT   76500  2026-06-04
77         HR   58500  2026-06-04
78  Marketing  -49000  2026-06-04
79    Finance   85000  2026-06-04
80        NaN   52000  2026-06-04
81         HR   57500  2026-06-04
82         IT   73500  2026-06-04
83  Marketing   64500  2026-06-04
84    Finance   81000  2026-06-04
85        NaN   56000  2026-06-04
86         IT  -68000  2026-06-04
87         HR   59000  2026-06-04
88  Marketing   66000  2026-06-04
89    Finance   86000  2026-06-04
90        NaN   51500  2026-06-04
91         HR   60000  2026-06-04
92         IT   74500  2026-06-04
93  Marketing  -47000  2026-06-04
94    Finance   82000  2026-06-04
95        NaN   55000  2026-06-04
96         IT   77000  2026-06-04
97         HR   61000  2026-06-04
98  Marketing   67500  2026-06-04
99    Finance   88000  2026-06-04

- feature columns (X)/ independent -> department, hire_date

- target column (Y)/ dependent -> salary(predict column)

Check null values
---

In [38]:
df.isna().sum()

department    20
salary         0
hire_date      0
dtype: int64

Handling null values
----

- Drop The Rows

- Use fullna method (mean, mode, median)

In [43]:
df.shape

(100, 3)

In [45]:
# handles the department  column

df.dropna(subset=['department'],inplace=True)

In [47]:
df.isna().sum()

department    0
salary        0
hire_date     0
dtype: int64

In [49]:
df['department'].isna().sum()

0

In [51]:
# handles the salaries
  # -> handles the null
  # -> handles the negative values

# negative values

df[df['salary']<=0] # mask

   department  salary   hire_date
3     Finance  -45000  2026-06-04
7   Marketing  -30000  2026-06-04
13    Finance  -52000  2026-06-04
18  Marketing  -41000  2026-06-04
24    Finance  -36000  2026-06-04
31         IT  -70000  2026-06-04
38  Marketing  -48000  2026-06-04
44    Finance  -39000  2026-06-04
53  Marketing  -44000  2026-06-04
61         HR  -52000  2026-06-04
68  Marketing  -46000  2026-06-04
78  Marketing  -49000  2026-06-04
86         IT  -68000  2026-06-04
93  Marketing  -47000  2026-06-04

In [55]:
df['salary']= df['salary'].abs() # Absolute method -> Return positive values.

In [64]:
df['salary'].head()

0    55000
1    72000
3    45000
4    52000
5    68000
Name: salary, dtype: int64

In [66]:
df['salary'].isna().sum()

0

Handles null value by using fillna method
----

In [ ]:
mean = df['salary'].mean()

df['salary'].fillna(mean,inplace=True)

print(mean)

In [ ]:
median = df['salary'].median()

df['salary'].fillna(median,inplace=True)

print(median)

In [69]:
df['salary'].head()

0    55000
1    72000
3    45000
4    52000
5    68000
Name: salary, dtype: int64

In [71]:
df.isna().sum()

department    0
salary        0
hire_date     0
dtype: int64

In [152]:
data = pd.read_csv(r'/Users/pranay/Downloads/emp data.csv')

In [154]:
data.head()

   employee_id first_name last_name department  salary   hire_date
0            1      Aarav    Sharma         HR   55000  2026-06-04
1            2     Vihaan     Patel         IT   72000  2026-06-04
2            3      Anaya     Gupta        NaN   48000  2026-06-04
3            4     Aditya     Mehta    Finance  -45000  2026-06-04
4            5       Isha     Verma         HR   52000  2026-06-04

In [156]:
df['department'].isna().sum()

20

In [158]:
# mode = data['department'].mode()[0] # High occurrence repeated value.

# data['department'] = data['department'].fillna(mode,inplace=True)

data['department'] = data['department'].astype('object')

In [160]:
mode = data['department'].mode().iloc[0]

data.fillna({'department': mode}, inplace=True)

In [174]:
data['department'].isna().sum()

0

In [172]:
data.isna().sum()

employee_id    0
first_name     0
last_name      0
department     0
salary         0
hire_date      0
dtype: int64

In [168]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  100 non-null    int64
 1   first_name   100 non-null    object
 2   last_name    100 non-null    object
 3   department   100 non-null    object
 4   salary       100 non-null    int64
 5   hire_date    100 non-null    object
dtypes: int64(2), object(4)
memory usage: 4.8+ KB

In [166]:
data.head()

   employee_id first_name last_name department  salary   hire_date
0            1      Aarav    Sharma         HR   55000  2026-06-04
1            2     Vihaan     Patel         IT   72000  2026-06-04
2            3      Anaya     Gupta         IT   48000  2026-06-04
3            4     Aditya     Mehta    Finance  -45000  2026-06-04
4            5       Isha     Verma         HR   52000  2026-06-04

In [176]:
data.select_dtypes(include=['int','float']).head()

   employee_id  salary
0            1   55000
1            2   72000
2            3   48000
3            4  -45000
4            5   52000

In [178]:
data.select_dtypes(exclude=['int','float']).head()

  first_name last_name department   hire_date
0      Aarav    Sharma         HR  2026-06-04
1     Vihaan     Patel         IT  2026-06-04
2      Anaya     Gupta         IT  2026-06-04
3     Aditya     Mehta    Finance  2026-06-04
4       Isha     Verma         HR  2026-06-04

In [180]:
data.select_dtypes(include=['object']).head()

  first_name last_name department   hire_date
0      Aarav    Sharma         HR  2026-06-04
1     Vihaan     Patel         IT  2026-06-04
2      Anaya     Gupta         IT  2026-06-04
3     Aditya     Mehta    Finance  2026-06-04
4       Isha     Verma         HR  2026-06-04

Convert the date column type of Object to the Date data type
----

In [183]:
data['hire_date'].dtype

dtype('O')

In [187]:
data['hire_date'] = pd.to_datetime(data['hire_date']).head()

In [189]:
today = pd.Timestamp(year=2026,month=2,day=26)

data[data['hire_date']>today]

   employee_id first_name last_name department  salary  hire_date
0            1      Aarav    Sharma         HR   55000 2026-06-04
1            2     Vihaan     Patel         IT   72000 2026-06-04
2            3      Anaya     Gupta         IT   48000 2026-06-04
3            4     Aditya     Mehta    Finance  -45000 2026-06-04
4            5       Isha     Verma         HR   52000 2026-06-04

In [191]:
data['hire_date'].dtype

dtype('<M8[ns]')

In [193]:
data.head()

   employee_id first_name last_name department  salary  hire_date
0            1      Aarav    Sharma         HR   55000 2026-06-04
1            2     Vihaan     Patel         IT   72000 2026-06-04
2            3      Anaya     Gupta         IT   48000 2026-06-04
3            4     Aditya     Mehta    Finance  -45000 2026-06-04
4            5       Isha     Verma         HR   52000 2026-06-04

In [197]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  100 non-null    int64
 1   first_name   100 non-null    object
 2   last_name    100 non-null    object
 3   department   100 non-null    object
 4   salary       100 non-null    int64
 5   hire_date    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.8+ KB

In [199]:
data['hire_date'] = data['hire_date'].fillna(pd.Timestamp('2026-06-04'))

In [201]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  100 non-null    int64
 1   first_name   100 non-null    object
 2   last_name    100 non-null    object
 3   department   100 non-null    object
 4   salary       100 non-null    int64
 5   hire_date    100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.8+ KB